; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-38)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 ball37 ball38 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(ball ball37)
(ball ball38)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room6)
(at ball34 room6)
(at ball35 room6)
(at ball36 room6)
(at ball37 room6)
(at ball38 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room4)
(at ball32 room4)
(at ball33 room4)
(at ball34 room4)
(at ball35 room4)
(at ball36 room4)
(at ball37 room4)
(at ball38 room4)
)
)
)

; plan
1. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 4 of 38
2. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 4 of 38
3. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 4 of 38
4. (drop ball4 room4 right)
   deleted: (carry ball4 right)
   added: (at ball4 room4) (free right)
   goals met: 5 of 38
5. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 6 of 38
6. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 6 of 38
7. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 6 of 38
8. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 6 of 38
9. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 6 of 38
10. (drop ball8 room4 right)
   deleted: (carry ball8 right)
   added: (at ball8 room4) (free right)
   goals met: 7 of 38
11. (drop ball9 room4 left)
   deleted: (carry ball9 left)
   added: (at ball9 room4) (free left)
   goals met: 8 of 38
12. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 8 of 38
13. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 8 of 38
14. (pick ball6 roomb right)
   deleted: (at ball6 roomb) (free right)
   added: (carry ball6 right)
   goals met: 8 of 38
15. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 8 of 38
16. (drop ball6 room4 right)
   deleted: (carry ball6 right)
   added: (at ball6 room4) (free right)
   goals met: 9 of 38
17. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 10 of 38
18. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 10 of 38
19. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 10 of 38
20. (pick ball12 roomb right)
   deleted: (at ball12 roomb) (free right)
   added: (carry ball12 right)
   goals met: 10 of 38
21. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 10 of 38
22. (drop ball12 room4 right)
   deleted: (carry ball12 right)
   added: (at ball12 room4) (free right)
   goals met: 11 of 38
23. (drop ball13 room4 left)
   deleted: (carry ball13 left)
   added: (at ball13 room4) (free left)
   goals met: 12 of 38
24. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 12 of 38
25. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 12 of 38
26. (pick ball10 roomb right)
   deleted: (at ball10 roomb) (free right)
   added: (carry ball10 right)
   goals met: 12 of 38
27. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 12 of 38
28. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 12 of 38
29. (drop ball10 room4 right)
   deleted: (carry ball10 right)
   added: (at ball10 room4) (free right)
   goals met: 13 of 38
30. (drop ball11 room4 left)
   deleted: (carry ball11 left)
   added: (at ball11 room4) (free left)
   goals met: 14 of 38
31. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 14 of 38
32. (pick ball38 room6 left)
   deleted: (at ball38 room6) (free left)
   added: (carry ball38 left)
   goals met: 14 of 38
33. (pick ball37 room6 right)
   deleted: (at ball37 room6) (free right)
   added: (carry ball37 right)
   goals met: 14 of 38
34. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 14 of 38
35. (drop ball37 room4 right)
   deleted: (carry ball37 right)
   added: (at ball37 room4) (free right)
   goals met: 15 of 38
36. (drop ball38 room4 left)
   deleted: (carry ball38 left)
   added: (at ball38 room4) (free left)
   goals met: 16 of 38
37. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 16 of 38
38. (pick ball36 room6 left)
   deleted: (at ball36 room6) (free left)
   added: (carry ball36 left)
   goals met: 16 of 38
39. (pick ball35 room6 right)
   deleted: (at ball35 room6) (free right)
   added: (carry ball35 right)
   goals met: 16 of 38
40. (move room6 room4)
   deleted: (at-robby room6)
   added: (at-robby room4)
   goals met: 16 of 38
41. (drop ball35 room4 right)
   deleted: (carry ball35 right)
   added: (at ball35 room4) (free right)
   goals met: 17 of 38
42. (drop ball36 room4 left)
   deleted: (carry ball36 left)
   added: (at ball36 room4) (free left)
   goals met: 18 of 38
43. (move room4 room6)
   deleted: (at-robby room4)
   added: (at-robby room6)
   goals met: 18 of 38
44. (pick ball34 room6 left)
   deleted: (at ball34 room6) (free left)
   added: (carry ball34 left)
   goals met: 18 of 38
45. (pick ball33 room6 right)
   deleted: (at ball33 room6) (free right)
   added: (carry ball33 right)
   goals met: 18 of 38
46. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 18 of 38
47. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 18 of 38
48. (drop ball33 room4 right)
   deleted: (carry ball33 right)
   added: (at ball33 room4) (free right)
   goals met: 19 of 38
49. (drop ball34 room4 left)
   deleted: (carry ball34 left)
   added: (at ball34 room4) (free left)
   goals met: 20 of 38
50. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 20 of 38
51. (pick ball32 room5 left)
   deleted: (at ball32 room5) (free left)
   added: (carry ball32 left)
   goals met: 20 of 38
52. (pick ball31 room5 right)
   deleted: (at ball31 room5) (free right)
   added: (carry ball31 right)
   goals met: 20 of 38
53. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 20 of 38
54. (drop ball31 room4 right)
   deleted: (carry ball31 right)
   added: (at ball31 room4) (free right)
   goals met: 21 of 38
55. (drop ball32 room4 left)
   deleted: (carry ball32 left)
   added: (at ball32 room4) (free left)
   goals met: 22 of 38
56. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 22 of 38
57. (pick ball30 room5 left)
   deleted: (at ball30 room5) (free left)
   added: (carry ball30 left)
   goals met: 22 of 38
58. (pick ball29 room5 right)
   deleted: (at ball29 room5) (free right)
   added: (carry ball29 right)
   goals met: 22 of 38
59. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 22 of 38
60. (drop ball29 room4 right)
   deleted: (carry ball29 right)
   added: (at ball29 room4) (free right)
   goals met: 23 of 38
61. (drop ball30 room4 left)
   deleted: (carry ball30 left)
   added: (at ball30 room4) (free left)
   goals met: 24 of 38
62. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 24 of 38
63. (pick ball28 room5 left)
   deleted: (at ball28 room5) (free left)
   added: (carry ball28 left)
   goals met: 24 of 38
64. (pick ball27 room5 right)
   deleted: (at ball27 room5) (free right)
   added: (carry ball27 right)
   goals met: 24 of 38
65. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 24 of 38
66. (drop ball27 room4 right)
   deleted: (carry ball27 right)
   added: (at ball27 room4) (free right)
   goals met: 25 of 38
67. (drop ball28 room4 left)
   deleted: (carry ball28 left)
   added: (at ball28 room4) (free left)
   goals met: 26 of 38
68. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 26 of 38
69. (pick ball26 room5 left)
   deleted: (at ball26 room5) (free left)
   added: (carry ball26 left)
   goals met: 26 of 38
70. (pick ball25 room5 right)
   deleted: (at ball25 room5) (free right)
   added: (carry ball25 right)
   goals met: 26 of 38
71. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 26 of 38
72. (drop ball25 room4 right)
   deleted: (carry ball25 right)
   added: (at ball25 room4) (free right)
   goals met: 27 of 38
73. (drop ball26 room4 left)
   deleted: (carry ball26 left)
   added: (at ball26 room4) (free left)
   goals met: 28 of 38
74. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 28 of 38
75. (pick ball24 room5 left)
   deleted: (at ball24 room5) (free left)
   added: (carry ball24 left)
   goals met: 28 of 38
76. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 28 of 38
77. (drop ball24 room4 left)
   deleted: (carry ball24 left)
   added: (at ball24 room4) (free left)
   goals met: 29 of 38
78. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 29 of 38
79. (pick ball19 room3 left)
   deleted: (at ball19 room3) (free left)
   added: (carry ball19 left)
   goals met: 29 of 38
80. (pick ball18 room3 right)
   deleted: (at ball18 room3) (free right)
   added: (carry ball18 right)
   goals met: 29 of 38
81. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 29 of 38
82. (drop ball18 room4 right)
   deleted: (carry ball18 right)
   added: (at ball18 room4) (free right)
   goals met: 30 of 38
83. (drop ball19 room4 left)
   deleted: (carry ball19 left)
   added: (at ball19 room4) (free left)
   goals met: 31 of 38
84. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 31 of 38
85. (pick ball17 room3 left)
   deleted: (at ball17 room3) (free left)
   added: (carry ball17 left)
   goals met: 31 of 38
86. (pick ball16 room3 right)
   deleted: (at ball16 room3) (free right)
   added: (carry ball16 right)
   goals met: 31 of 38
87. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 31 of 38
88. (drop ball16 room4 right)
   deleted: (carry ball16 right)
   added: (at ball16 room4) (free right)
   goals met: 32 of 38
89. (drop ball17 room4 left)
   deleted: (carry ball17 left)
   added: (at ball17 room4) (free left)
   goals met: 33 of 38
90. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 33 of 38
91. (pick ball15 room3 left)
   deleted: (at ball15 room3) (free left)
   added: (carry ball15 left)
   goals met: 33 of 38
92. (pick ball14 room3 right)
   deleted: (at ball14 room3) (free right)
   added: (carry ball14 right)
   goals met: 33 of 38
93. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 33 of 38
94. (drop ball14 room4 right)
   deleted: (carry ball14 right)
   added: (at ball14 room4) (free right)
   goals met: 34 of 38
95. (drop ball15 room4 left)
   deleted: (carry ball15 left)
   added: (at ball15 room4) (free left)
   goals met: 35 of 38
96. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 35 of 38
97. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 35 of 38
98. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 35 of 38
99. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 35 of 38
100. (drop ball2 room4 right)
   deleted: (carry ball2 right)
   added: (at ball2 room4) (free right)
   goals met: 36 of 38
101. (drop ball3 room4 left)
   deleted: (carry ball3 left)
   added: (at ball3 room4) (free left)
   goals met: 37 of 38
102. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 37 of 38
103. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 37 of 38
104. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 37 of 38
105. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 38 of 38
